"""
Выполни PUT-запрос на https://httpbin.org/put, отправив
JSON с изменением одного поля. Проверь, что оно обновилось в ответе.
"""

"""
Отправь PUT-запрос с кастомным заголовком и телом. Убедись, что и тело, и заголовки корректно вернулись.
"""

"""
Представь, что у тебя есть ресурс user с ID. Выполни PUT-запрос на /users/2, 
изменяя email. Проверь статус ответа и обновлённое тело.
"""

"""
Отправь PUT-запрос, полностью заменяя объект. Проверь, что отсутствующие поля 
в старом объекте не сохраняются, если они не переданы.
"""