"""
Отправь DELETE-запрос на https://httpbin.org/delete и проверь, что пришёл ответ со статусом 200 OK.
"""

"""
Представь, что у тебя есть ресурс /users/{id}. Отправь DELETE-запрос на /users/10 
и проверь, что сервер сообщает об успешном удалении.
"""

"""
Удали объект, а затем попытайся его получить (GET). Убедись, что сервер возвращает 404 Not Found.
"""

"""
Выполни DELETE-запрос к защищённому ресурсу, передав авторизационный токен. 
Проверь, что без него запрос не проходит, а с ним — успешен.
"""